from django.test import TestCase
from cities.models import City,District

district_list={
'1':[
     "حصاربوعلی", "رستم آباد- فرمانیه", "اوین", "درکه", "زعفرانیه", "محمودیه", "ولنجک", 
    "امام زاده قاسم (ع)", "دربند", "گلابدره", "جماران", "دزاشیب", "نیاوران", "اراج", 
    "کاشانک", "شهرک دانشگاه", "شهرک نفت", "دارآباد", "باغ فردوس", "تجریش", "قیطریه", 
    "چیذر", "حکمت", "ازگل", "سوهانک", "شهید محلاتی", "اتوبان امام علی", "اتوبان صدر", 
    "اقدسیه", "الهیه – فرشته", "اندرزگو", "بلوار ارتش", "پارک وی", "تجریش", "جمشیدیه", 
    "دیباجی", "سعدآباد", "صاحبقرانیه", "فرمانیه", "قیطریه", "محمودیه", "مقدس اردبیلی", 
    "مینی سیتی", "نوبنیاد", "ولیعصر", "کاشانک", "کامرانیه"
],
'2':[
    "بوعلی", "سعادت‌آباد", "مدیریت", "کوهسار", "پونک", "شهید چوب‌تراش", "شهید خرم‌رودی", 
    "صادقیه شمالی شهرک هما", "صادقیه", "شهرآرا", "کوی نصر", "پردیسان", "شهرک آزمایش", 
    "تهران ویلا", "برق آلستوم", "تیموری", "طرشت", "همایونشهر", "توحید", "زنجان", "شادمهر", 
    "ایوانک", "دریا", "شهرک قدس", "آسمانها", "درختی", "فرحزاد", "مخابرات", "پرواز", "آزادی", 
    "اتوبان حکیم", "اتوبان شیخ فضل‌اله", "اتوبان محمد علی جناح", "اتوبان نیایش", "اتوبان یادگار امام", 
    "بهبودی", "جلال آل احمد", "خوش شمالی", "ستارخان", "شادمان", "شهرک ژاندارمری", "شهرک غرب", 
    "گیشا", "مترو شریف", "مرزداران"
],
'3':[
    "آرارات", "ونک", "امانیه", "زرگنده", "درب دوم", "رستم آباد و اختیاریه", 
    "داودیه", "سید خندان", "دروس", "قبا", "قلهک", "کاوسیه", "اختیاریه", 
    "پاسداران", "جردن", "جلفا", "خواجه عبداله", "دولت (کلاهدوز)", 
    "شیخ بهایی", "شیراز", "ظفر", "ملاصدرا", "میدان کتابی", 
    "میرداماد", "ولیعصر (بین پارک وی و نیایش)"
],
'4':[
    "مهران", "کاظم آباد", "کوهک", "مجیدیه و شمس آباد", "پاسداران و ضرابخانه",
    "حسین آباد و مبارک آباد", "شیان و لویزان", "علم و صنعت", "نارمک", "تهرانپارس غربی",
    "جوادیه", "خاک سفید", "تهرانپارس شرقی", "قاسم آباد و ده نارمک", "اوقاف",
    "شمیران نو", "حکیمیه", "قنات کوثر", "کوهسار", "مجید آباد", "اتوبان بابایی",
    "اتوبان باقری", "اتوبان صیاد شیرازی", "بنی هاشم", "پلیس", "دلاوران", "رسالت",
    "سراج", "شمس آباد", "شهدا", "صیاد شیرازی", "علم و صنعت", "فرجام", "لویزان",
    "میدان ملت", "هروی", "هنگام"
],
'5':[
    "شهران جنوبی", "شهران شمالی", "شهرزیبا", "اندیشه", "بهاران", "کن", "المهدی",
    "باغ فیض", "پونک جنوبی", "پونک شمالی", "حصارک", "شهرک نفت", "کوهسار", "مرادآباد",
    "پرواز", "سازمان برنامه جنوبی", "سازمان برنامه شمالی", "ارم", "سازمان آب", "اباذر",
    "فردوس", "مهران", "اکباتان", "بیمه", "آپادانا", "جنت آباد جنوبی", "جنت آباد شمالی",
    "جنت آباد مرکزی", "شاهین", "آیت الله کاشانی", "اشرفی اصفهانی", "ایران زمین شمالی",
    "بلوار تعاون", "بلوار فردوس", "بولیوار", "پونک", "پیامبر", "جنت آباد", 
    "سازمان برنامه", "ستاری", "سردار جنگل", "سولقان", "شهر زیبا", "شهران", 
    "شهرک اکباتان", "شهید مهدی باکری"
],
'6':[
    "نجات اللهی", "ایرانشهر", "پارک لاله", "کشاورز غربی", "نصرت", "۱۶ آذر", 
    "سنایی", "بهجت آباد", "عباس آباد", "قزل قلعه", "سیندخت", "گلها", "شیراز جنوبی", 
    "گاندی", "ساعی", "یوسف آباد", "جهاد", "جنت", "آرژانتین", "اتوبان همت", 
    "اسکندری", "امیر آباد", "بلوار کشاورز", "توانیر", "جمال زاده", "حافظ", 
    "زرتشت", "طالقانی", "فاطمی", "فلسطین", "میدان انقلاب اسلامی", "میدان ولیعصر", 
    "وزراء", "کارگر شمالی", "کردستان", "کریم خان"
],
'7':[
    "شارق الف", "دهقان", "شارق ب", "گرگان", "نظام آباد", "خواجه نصیر و حقوقی",
    "خواجه نظام شرقی", "خواجه نظام غربی", "کاج", "امجدیه خاقانی", "بهار",
    "سهروردی باغ صبا", "شهید قندی- نیلوفر", "عباس آباد- اندیشه", "حشمتیه", "دبستان",
    "ارامنه الف", "ارامنه ب", "قصر", "آپادانا", "امام حسین", "انقلاب", "خواجه نظام",
    "سرباز", "سهروردی", "شریعتی", "شهید مدنی", "شیخ صفی", "عباس آباد", "مدنی",
    "مرودشت", "مطهری", "مفتح جنوبی", "هفت تیر"
]

}

#add several district

# for key, values in district_list.items():
#     if key in ['1','2','3']:
#         for value in values:
#             city = City.objects.filter(name='تهران').first()
#             if city:
#                 # Ensure the district instance exists or create it if it does not
#                 district_instance, created = District.objects.get_or_create(name=value)
#                 # Add the district to the city's districts
#                 city.district.add(district_instance)
